<html>

<head> <META http-equiv="Content-Type" content="text/html; charset=UTF8"> <LINK REL=STYLESHEET HREF="default.css" TYPE="text/css"> </head>

<body bgcolor="#ffffff">

<a name="dir_list"></a> <h2>Daten&uuml;bertragung</h2>

Die ist &uuml;blicherweise die Hauptanwendung von Secure FTP. Es gibt drei Arten von Daten&uuml;bertragungen: Herunterladen, Hinaufladen und Inhaltsangabe eines Verzeichnisses.

<h3>Inhaltsangabe eines Verzeichnisses</h3>

Die Inhaltsangabe eines Verzeichnisses geschieht &uuml;blicherweise automatisch. D. h. wenn Sie das Verzeichnis wechseln wird versucht, dessen Inhalt anzuzeigen. Sie k&ouml;nnen die Inhaltsangabe eines Verzeichnisses auch erzwingen, indem Sie den <img src="../en/images/refresh.png"> <i>Aktualisieren</i>-Knopf dr&uuml;cken, der sich in der Werkzeugleiste befindet.

<a name="download"></a> <h3>Herunterladen</h3>

Herunterladen bedeutet, dass Sie eine Datei von einem anderen Rechner auf Ihren <i>herunter</i> &uuml;bertragen.
Daf&uuml;r gibt es mehrere M&ouml;glichkeiten. Die einfachste ist, alle gewünschten Dateien auszuw&auml;hlen und den <img src="../en/images/download.png"> <i>Herunterladen</i>-Knopf zu dr&uuml;cken (zu finden in der Werkzeugleiste). Damit &uuml;bertragen Sie die ausgew&auml;hlten Dateien in Ihr lokales Verzeichnis (welches auf der linken Seite des Fensters angezeigt wird).

<br><br>

Optional k&ouml;nnen Sie die ausgew&auml;hlten Dateien vom Ziel-Verzeichnis (rechte Seite) in Ihr lokales Verzeichnis (linke Seite) ziehen. Wenn Sie diese auf ein Verzeichnis innerhalb Ihres lokalen Verzeichnisses ziehen wird dieses Unterverzeichnis ausgew&auml;hlt was bedeutet, dass die heruntergeladenen Dateien dort gespeichert werden (anstatt im &uuml;bergeordneten Verzeichnis).

<a name="upload"></a> <h3>Hinaufladen</h3>

Hinaufladen bedeutet, dass Sie eine Datei von Ihrem Rechner auf einen anderen <i>hinauf</i> &uuml;bertragen. Daf&uuml;r gibt es mehrere M&ouml;glichkeiten. Die einfachste ist, alle gewünschten Dateien auszuw&auml;hlen und den <img src="../en/images/upload.png"> <i>Hinaufladen</i>-Knopf zu dr&uuml;cken (zu finden in der Werkzeugleiste). Damit &uuml;bertragen Sie die ausgew&auml;hlten Dateien in das Ziel-Verzeichnis (welches auf der rechten Seite des Fensters angezeigt wird).

<br><br>

Optional k&ouml;nnen Sie die ausgew&auml;hlten Dateien von Ihrem lokalen Verzeichnis (linke Seite) in das Ziel-Verzeichnis (rechte Seite) ziehen. Wenn Sie diese auf ein Verzeichnis innerhalb des Ziel-Verzeichnisses ziehen wird dieses Unterverzeichnis ausgew&auml;hlt was bedeutet, dass die heruntergeladenen Dateien dort gespeichert werden (anstatt im Zielverzeichnis). Ebenso k&ouml;nnen Sie Dateien aus Ihrem Dateisystem (z. B. dem Schreibtisch) auf das Ziel-Verzeichnis ziehen.

<br>

</body>

</html>
